"""
Налаштування та константи для гри Tetris.
"""
from typing import Tuple, Dict

# --- Налаштування екрану та сітки ---
WIDTH: int = 1000
HEIGHT: int = 850
FPS: int = 60

CELL: int = 30  # Розмір однієї клітинки
COLS: int = 12
ROWS: int = 22

# Координати верхнього лівого кута сітки
GRID_X: int = 50
GRID_Y: int = 100

# --- Кольорова палітра ---
BLACK: Tuple[int, int, int] = (40, 40, 40)
WHITE: Tuple[int, int, int] = (255, 255, 255)
BG_COLOR: Tuple[int, int, int] = (0, 0, 0)
GRID_BG: Tuple[int, int, int] = (235, 245, 255)
GRID_LINE: Tuple[int, int, int] = (180, 200, 220)

FALL_SPEED: float = 0.9 # Швидкість падіння фігур

# --- Кольори фігур  ---

SHAPE_COLORS = {
    'I': (173, 216, 230),      
    'I_rot': (135, 206, 250),  

    'O': (204, 204, 79),    

    'J_0': (176, 196, 222),    
    'J_90': (100, 149, 237),   
    'J_180': (70, 130, 180),   
    'J_270': (176, 224, 230),  

    'L_0': (255, 255, 153),    
    'L_90': (255, 228, 181),   
    'L_180': (255, 239, 213),  
    'L_270': (255, 160, 122),

    'S': (193, 255, 193),    
    'S_rot': (152, 251, 152),

    'Z': (255, 182, 193),    
    'Z_rot': (255, 192, 203), 

    'T_0': (255, 140, 105),    
    'T_90': (216, 191, 216),   
    'T_180': (221, 160, 221),  
    'T_270': (186, 85, 211)   
}


