"""
Налаштування та константи для гри Tetris.
"""
from typing import Tuple

# Розміри ігрового поля (в блоках)
COLS: int = 10
ROWS: int = 20

# Розміри одного блоку (в пікселях)
BLOCK_SIZE: int = 30

# Кольори екрану та сітки
BG_COLOR: Tuple[int, int, int] = (0, 0, 0)
GRID_COLOR: Tuple[int, int, int] = (128, 128, 128)

# Швидкість гри
FPS: int = 60
FALL_SPEED: float = 0.5

WIDTH = 1000
HEIGHT = 850
CELL = 30
COLS = 12
ROWS = 22
GRID_X = 50
GRID_Y = 100

GRID_BG = (235, 245, 255)
GRID_LINE = (180, 200, 220)
WHITE = (255, 255, 255)
BLACK = (40, 40, 40)



SHAPE_COLORS = {
    'I': (173, 216, 230),      
    'I_rot': (135, 206, 250),  

    'O': (204, 204, 79),    

    'J_0': (176, 196, 222),    
    'J_90': (100, 149, 237),   
    'J_180': (70, 130, 180),   
    'J_270': (176, 224, 230),  

    'L_0': (255, 255, 153),    
    'L_90': (255, 228, 181),   
    'L_180': (255, 239, 213),  
    'L_270': (255, 160, 122),

    'S': (193, 255, 193),    
    'S_rot': (152, 251, 152),

    'Z': (255, 182, 193),    
    'Z_rot': (255, 192, 203), 

    'T_0': (255, 140, 105),    
    'T_90': (216, 191, 216),   
    'T_180': (221, 160, 221),  
    'T_270': (186, 85, 211)   
}


